<template>
  <div class="main">
    <h1 ref="reset">История организации</h1>
    <span>Просмотр</span>
    <hr />
    <h3>Lorem Ipsum</h3>
    <base-constructor :data="data"></base-constructor>
  </div>
</template>

<script setup>
import { onMounted, useTemplateRef } from "vue";
import BaseConstructor from "./components/BaseConstructor.vue";
const reset = useTemplateRef("reset");
const data = [
  {
    text: "1990",
    img: "../assets/images/1.jpg",
    body: `Владельцы кошек нередко замечают одну интересную особенность в их поведении, как они усердно пытаются закопать миску с едой. 
    Иногда питомцы зарывают только оставшиеся частички пищи, а порой делают это вовсе не притронувшись к содержимому миски.`,
  },
  {
    text: "1996",
    img: "../assets/images/2.jpg",
    body: `Помимо материала кошкам следует подбирать миску подходящую по размеру. 
  Если у посуды слишком высокие бортики или диаметр несоразмерен питомцу, возможно, он откажется от еды, пытаясь ее прикопать. 
  Выбирайте миску, чтобы во время приема пищи свободно умещались вибриссы (усы) кошки, и ей не приходилось с трудом доставать кусочки пищи из посуды нестандартной формы.
Обратите внимание на то место, где расположены кошачьи миски. Если это место на проходе или в шумном помещении с большим количеством людей, питомец не будет 
чувствовать себя в безопасности. Также кошке может не нравиться уголок на сквозняке или с посторонними запахами, например, от бытовой химии.`,
  },
  {
    text: "2007",
    img: "../assets/images/3.jpg",
    body: `Усы, так называемые вибриссы, необходимы кошкам для ориентирования в пространстве. Животное словно антеннами улавливает малейшее колебание воздуха, 
    что дает возможность ей ночью охотиться и свободно передвигаться по местности или квартире`,
  },
  {
    text: "2012",
    img: "../assets/images/4.jpg",
    body: `Сердце котика бьётся чаще чем у собаки. В норме сердцебиение у взрослых котов составляет 100-140 ударов в минуту, а у маленьких – 200-220. Вот, например,
     сердце человека в среднем в час бьется 60-80 ударов в минуту. А вот у кита всего лишь 9 ударов в минуту.`,
  },
  {
    text: "2014",
    img: "../assets/images/5.jpg",
    body: `Научная статья — законченное авторское произведение, описывающее результаты оригинального научного исследования 
    (первичная научная статья) или посвящённая рассмотрению ранее опубликованных научных статей, связанных общей темой 
    (обзорная научная статья). В первичных научных статьях авторами излагается существенная информация о проведённом исследовании 
    в форме, позволяющей другим членам научного сообщества оценить исследование, воспроизвести эксперименты, а также оценить рассуждения 
    и сделанные из них выводы. Обзорные научные статьи предназначены для обобщения, анализа, оценки, суммирования или синтеза ранее опубликованной 
    информации (первичных научных публикаций). Нередко научная статья сочетает в себе эти два типа научных текстов, включая обзорную и оригинальную части.`,
  },
  {
    text: "2017",
    img: "../assets/images/6.jpg",
    body: `Проект «КиберЛенинка» призван исправить ситуацию в этой области. Мы предоставляем универсальный каталог, в котором содержится множество статей различных научных журналов, в том числе и рекомендованных ВАК РФ, классифицированных с помощью Государственного рубрикатора научно-технической информации (ГРНТИ), в свободном доступе и бесплатно.`,
  },
  {
    text: "2025",
    img: "../assets/images/5.jpg",
    body: `Котики не только завоевали популярность в интернете, но и стали настоящим оружием против стресса. 
    Мемы с любимыми пушистыми друзьями способны снизить уровень тревожности и помочь людям справляться с напряжением. 
    Об этом KP.RU рассказал кандидат психологических наук, доцент кафедры теоретических основ социальной 
    психологии Московского государственного психолого-педагогического университета Никита Кочетков.`,
  },
];

onMounted(() => {
  let observer = new IntersectionObserver(
    (entries) => {
      entries.forEach((entry) => {
        if (entry.isIntersecting) {
          const contents = document.querySelectorAll(".item__content");
          contents.forEach((content) => {
            content.classList.remove("active"); // удаляем класс active
          });
        }
      });
    },
    {
      threshold: 1,
    }
  );

  observer.observe(reset.value);
});
</script>

<style lang="scss">
@use "./assets/style.scss";
</style>
