<template>
  <div class="main">
    <h1 ref="reset">История организации</h1>
    <span>Просмотр</span>
    <hr />
    <h3>Lorem Ipsum</h3>
    <base-constructor :data="data"></base-constructor>
  </div>
</template>

<script setup>
import { onMounted, useTemplateRef } from "vue";
import BaseConstructor from "./components/BaseConstructor.vue";
const reset = useTemplateRef("reset");
const data = [
  {
    text: "1990",
    body: `gvavgvgdavc dcgsgcv    dsscsgacvgjcd gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv
  gvavgvgdavc dcgsgcv`,
  },
  { text: "1996", body: "gvavg" },
  {
    text: "2007",
    body: `Усы, так называемые вибриссы, необходимы кошкам для ориентирования в пространстве. Животное словно антеннами улавливает малейшее колебание воздуха, 
    что дает возможность ей ночью охотиться и свободно передвигаться по местности или квартире`,
  },
  {
    text: "2012",
    body: `Сердце котика бьётся чаще чем у собаки. В норме сердцебиение у взрослых котов составляет 100-140 ударов в минуту, а у маленьких – 200-220. Вот, например,
     сердце человека в среднем в час бьется 60-80 ударов в минуту. А вот у кита всего лишь 9 ударов в минуту.`,
  },
  {
    text: "2014",
    body: `Научная статья — законченное авторское произведение, описывающее результаты оригинального научного исследования 
    (первичная научная статья) или посвящённая рассмотрению ранее опубликованных научных статей, связанных общей темой 
    (обзорная научная статья). В первичных научных статьях авторами излагается существенная информация о проведённом исследовании 
    в форме, позволяющей другим членам научного сообщества оценить исследование, воспроизвести эксперименты, а также оценить рассуждения 
    и сделанные из них выводы. Обзорные научные статьи предназначены для обобщения, анализа, оценки, суммирования или синтеза ранее опубликованной 
    информации (первичных научных публикаций). Нередко научная статья сочетает в себе эти два типа научных текстов, включая обзорную и оригинальную части.`,
  },
  {
    text: "2025",
    body: `Проект «КиберЛенинка» призван исправить ситуацию в этой области. Мы предоставляем универсальный каталог, в котором содержится множество статей различных научных журналов, в том числе и рекомендованных ВАК РФ, классифицированных с помощью Государственного рубрикатора научно-технической информации (ГРНТИ), в свободном доступе и бесплатно.`,
  },
];

onMounted(() => {
  let observer = new IntersectionObserver(
    (entries) => {
      entries.forEach((entry) => {
        if (entry.isIntersecting) {
          const contents = document.querySelectorAll(".item__content");
          contents.forEach((content) => {
            content.classList.remove("active"); // удаляем класс active
          });
        }
      });
    },
    {
      threshold: 1,
    }
  );

  observer.observe(reset.value);
});
</script>

<style lang="scss">
@use "./assets/style.scss";
</style>
